{
    "translation": {
        "aboutTitle": "Sobre mim",
        "projectsTitle": "Projetos",
        "contactTitle": "Contato",
        "heroPresentation": "Olá! eu sou",
        "heroTitle1": "Desenvolvedor",
        "heroTitle2": "Full-Stack",
        
        "textAboutP1.1": "Desenvolvedor full-stack especializado em criar soluções escaláveis e de alto impacto com Node.js, TypeScript e infraestrutura em nuvem (AWS). Experiência prática em projetos que digitalizam processos, melhoram a eficiência operacional e seguem princípios de Clean Code e SOLID.",
        
        "technologies": "Tecnologias que domino:",
        "technologiesLanguages": "Linguagens:",
        "technologiesLanguagesContent": "TypeScript, JavaScript, SQL, C#  HTML5, CSS3",
        "technologiesFrameworks": "Frameworks",
        "technologiesFrameworksContent": "Node.js, Express, NestJS, React, Next JS",
        "technologiesDataBase": "banco de dados",
        "technologiesDataBaseContent": "MySQL, PostgreSQL, SQLite",
        "technologiesTests": "Testes",
        "technologiesTestsContent": "Jest (testes automatizados), Postman (testes manuais)",
        "technologiesDevops": "DevOps",
        "technologiesDevopsContent": "Docker, Nginx, AWS (EC2, S3), Git, GitHub",
        
        "quiroTitle": "Sistema de Gestão para Clinica de Quiropraxia",
        "quiroDescription1": "Desenvolvi um sistema de gestão para uma clínica de quiropraxia, composto por uma API RESTful baseada em Clean Architecture e uma interface moderna implementada com Next.js e TailwindCSS. O sistema permite o cadastro e gerenciamento de pacientes e agendamentos, com autenticação segura via JWT integrada a um banco de dados MySQL.",
        "quiroDescription2": "Implementei caching eficiente no cliente e no servidor, além de testes automatizados com Jest, garantindo alta performance e confiabilidade. O deploy foi realizado em uma infraestrutura escalável e segura, utilizando Docker, AWS EC2, Nginx e Certbot para SSL.",
        "quiroDescription3": "Esse projeto digitalizou processos antes realizados manualmente, reduzindo em 40% o tempo de pesquisa e avaliação da evolução dos pacientes, com funcionalidades robustas para facilitar o monitoramento e gerenciamento de informações clínicas."
    }
}